; domain
(define (domain blockWorld)
    (:requirements :strips :typing)
    (:types block)
    (:predicates
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )
    (:action pick-up
        ;;; Action qui ramasse un bloc posé sur la table
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x))
                (not (clear ?x))
                (not (handempty))
                (holding ?x))
    )
    (:action put-down
        ;;; Action qui pose un block ?x sur la table
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (ontable ?x)
                (clear ?x)
                (handempty)
                (not (holding ?x)))
    )
    (:action stack
        ;;; Action qui empile un block ?x sur un autre block ?y
        :parameters (?x - block ?y - block)
        :precondition (and (clear ?y) (holding ?x))
        :effect (and (on ?x ?y)
                (clear ?x)
                (handempty)
                (not (clear ?y))
                (not (holding ?x)))
    )
    (:action unstack
        ;;; Action qui dépile un block ?x d'un autre block ?y
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x)
                (clear ?y)
                (not (on ?x ?y))
                (not (clear ?x))
                (not (handempty)))
    )
)

; problem
(define (problem blockProblem1)
    (:domain blockWorld)
    (:objects A B C D - block)
    (:init  (clear B)
            (ontable A)
            (on B A)
            (clear C)
            (ontable D)
            (on C D)
            (handempty))
    (:goal (and (on A B) (on D C) (clear A) (clear D) (ontable B) (ontable C) (handempty)))
)

; plan
1. (unstack b a)
   deleted: (on b a) (clear b) (handempty)
   added: (holding b) (clear a)
   goals met: 1 of 7
2. (put-down b)
   deleted: (holding b)
   added: (ontable b) (clear b) (handempty)
   goals met: 3 of 7
3. (unstack c d)
   deleted: (on c d) (clear c) (handempty)
   added: (holding c) (clear d)
   goals met: 3 of 7
4. (put-down c)
   deleted: (holding c)
   added: (ontable c) (clear c) (handempty)
   goals met: 5 of 7
5. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 3 of 7
6. (stack d c)
   deleted: (clear c) (holding d)
   added: (on d c) (clear d) (handempty)
   goals met: 6 of 7
7. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 4 of 7
8. (stack a b)
   deleted: (clear b) (holding a)
   added: (on a b) (clear a) (handempty)
   goals met: 7 of 7
